class NewsDatas {
  final String? id;
  final String? titel;
  final String? image;
  final String? Date;
  final String? titelNews;

  NewsDatas({this.id, this.titel, this.image, this.Date, this.titelNews});
}

List<NewsDatas> NewsData_data = [
  NewsDatas(
    id: 'c2',
    titel:
        'الهيئة العامة للتأمينات والمعاشات تستكمل مشروع بيانات موظفي الدولة بالجهاز الإدارى والقطاعين العام والمختلط والصناديق المستقلة',
    Date: '2022/1/4',
    titelNews:
        'كرم الأستاذ سليم المغلس وزير الخدمة المدنية والتأمينات اليوم فريق عمل الهيئة العامة للتأمينات والمعاشات الذي اشتغل في مشروع استكمال بيانات موظفي الدولة بالجهاز الإدارى والقطاعين العام والمختلط والصناديق المستقلة واستيفاء بيانات الموظفين الخاصة بالسجل المدني والرقم الوطني والمؤهلات والذي سيساهم في إصلاح كشف الراتب والقضاء على الازدواج الوظيفي وخلال تسليم شهادات التقدير لفريق عمل الهيئة العامة للتأمينات والمعاشات، اشاد وزيرالخدمة المدنية والتأمينات بدور الهيئة ومايقومون به من جهد كبير في ايصال الهيئة الى هذا المستوى من البيانات واتمتة العمل واعتماد النظام الآلي في كافة أعمالها وعبر عن اعتزازه بعمل وجهود فريق عمل الهيئة الذي تم بإشراف الأستاذ ابراهيم الحيفي رئيس الهيئة وخلال التكريم تم تسليم شهادات تقدير لفريق عمل الهيئة في مشروع استكمال البيانات لموظفي الدولة (المؤمن عليهم ) وهم : على يحيى الاسعدي - بندر محمد شمس الدين - عبداللطيف عبدالله الضياني - أديب عمر العريقي الجدير بالذكر ان فريق المشروع استكمل بيانات موظفي الدولة والتي تشمل بيانات الرقم الوطني والبيانات الشخصية والوظيفية والمالية والمؤهلات والتخصصات والذي بدورها سوف تساعد في : -الاستغلال الأمثل للكوادر البشرية من موظفي الدولة. -معرفة الازدواج وتصحيح كشف الراتب. -حفظ حقوق المؤمن عليهم وتحصيل اشتراكاتهم التأمينية. - صرف رواتب موظفي الدوله عبر الرقم الوطني حضر التكريم الأستاذ محمد ابوطالب وكيل الوزارة لقطاع المعلومات والاستاذ عارف العواضي الوكيل الفني للهيئةوالأستاذ فضل الأكوع الوكيل المالي والاداري للهيئةوالمهندس صادق الشوبة مساعد مدير عام الحاسب بالهيئة',
    image: 'asset/a1.jpg',
  ),
  NewsDatas(
    id: 'c3',
    titel: 'اليوم .. اقامة دوري رياضي حماسي بمناسبة اسبوع الشهيد',
    Date: '2022/1/3',
    titelNews:
        'يقام عصر اليوم الاثنين دوري رياضي بمناسبة اسبوع الشهيد ،، تنظمه الهيئة العامة للتأمينات والمعاشات على ملعب الزهور بصنعاء وذلك برعاية الأستاذ ابراهيم الحيفي رئيس الهيئة ،، وسيلعب في الدوري اربع فرق رياضية من الهيئة تم تقسيمها كالتالي : 1- فريق قطاع رئيس الهيئة 2- فريق قطاع الفروع 3- فريق القطاع المالي 4- فريق القطاع الفني حيث ستنطلق المباراة الأولى في تمام الساعة الرابعة عصر اليوم بين فريقي قطاع الرئيس و القطاع المالى والمباراة الثانية بين فريقي قطاع الفروع والقطاع الفني بعد ذلك ستكون المباراة النهائية بين الفريق الفائز في المباراة الأولى مع الفريق الفائز في المباراة الثانية ،،',
    image: 'asset/a1.jpg',
  ),
  NewsDatas(
    id: 'c4',
    titel:
        'الهيئة العامة للتأمينات والمعاشات تصرف للمتقاعدين المدنيين النصف الثاني من معاش شهر يونيو ٢٠١٨م',
    image: 'asset/a1.jpg',
    Date: '2021/12/26',
    titelNews:
        'في اطار اهتمامها المستمر بشريحة المتقاعدين والسعي الدائم للتخفيف عن معاناتهم بسبب الحصار المفروض على البلاد من قبل دول العدوان تبداء الهيئة العامة للتأمينات والمعاشات غدآ الخميس بعملية صرف النصف الثاني من معاش شهر يونيو 2018م للمتقاعدين المدنيين وذلك عبر مكاتب البريد في أمانة العاصمة وعموم المحافظات وأوضح الأستاذ ابراهيم احمد الحيفي رئيس الهيئة انه تم استكمال الاجراءات المالية وضخ المبالغ النقدية للبريد للبدء بعملية الصرف من غدآالخميس ،الموافق 30 ديسمبر 2021 م . ودعا الإخوة المتقاعدين ووكلاء المستفيدين التوجه الى مكاتب البريد مصطحبين البطائق الشخصية والمعاشية لتسهيل استلام المعاش مشيداً بجهود كوادر الهيئة وكل من شارك وساهم في تجاوز كل الصعوبات والتعقيدات الناتجة عن تفاقم وزيادة مشكلة نقص السيولة النقدية التي تعاني منها البلاد بسبب نقل وظائف البنك المركزي الى عدن فضلآ عن تلك السياسات العدوانية الممنهجة على الاقتصادالوطني التي ادت الى ازمات كارثية في كافة القطاعات الخدمية والانسانية والمصرفية واخرت دفع المعاشات التقاعدية ومرتبات الموظفين عن موعدها المحدد. وقال الحيفي : ان هيئة التأمينات رغم الصعوبات التي تواجهها بسبب العدوان وحربهم الاقتصادية الممنهجة على البلاد الا انها صرفت خلال هذا العام 2021م تسع مرات من نصف معاش للمتقاعدين المدنيين ،، بمايعادل صرف نصف معاش كل 40 يوم وأنها تبذل جهود مستمرة وصولآ الى انتظام صرف المعاشات التقاعدية خلال العام القادم باذن الله',
  ),
  NewsDatas(
    id: 'c5',
    titel:
        'الهيئة العامة للتأمينات والمعاشات تدعو المتقاعدين المدنيين للتوجه إلى مكاتب البريد لاستلام النصف الاول من معاش شهر يونيو ٢٠١٨م',
    image: 'asset/R2.jpg',
    Date: '2021/12/17',
    titelNews:
        'في اطار اهتمامها المستمر بشريحة المتقاعدين والسعي الدائم للتخفيف عن معاناتهم بسبب الحصار المفروض على البلاد من قبل دول العدوان بدات الهيئة العامة للتأمينات والمعاشات اليوم الخميس بعملية صرف النصف الاول من معاش شهر يونيو 2018م للمتقاعدين المدنيين وذلك عبر مكاتب البريد في أمانة العاصمة وعموم المحافظات وأوضح الأستاذ ابراهيم الحيفي رئيس الهيئة انه تم استكمال الاجراءات المالية وضخ المبالغ النقدية للبريد للبدء بعملية الصرف من عصر اليوم الخميس 12 جمادالاول 1443هجري ،الموافق 16 ديسمبر 2021 م . ودعا الإخوة المتقاعدين ووكلاء المستفيدين التوجه الى مكاتب البريد مصطحبين البطائق الشخصية والمعاشية لتسهيل استلام المعاش مشيداً بجهود كوادر الهيئة وكل من شارك وساهم في تجاوز كل الصعوبات والتعقيدات الناتجة عن تفاقم وزيادة مشكلة نقص السيولة النقدية التي تعاني منها البلاد بسبب نقل وظائف البنك المركزي الى عدن فضلآ عن تلك السياسات العدوانية الممنهجة على الاقتصادالوطني التي ادت الى ازمات كارثية في كافة القطاعات الخدمية والانسانية والمصرفية واخرت دفع المعاشات التقاعدية ومرتبات الموظفين في موعدها المحدد. الجدير بالذكر ان هيئة التأمينات صرفت خلال هذا العام 2021 قرابة 8 معاشات للمتقاعدين المدنيين ،، وأنها تبذل جهود مستمرة وصولآ الى انتظام صرف المعاشات التقاعدية خلال العام القادم باذن الله',
  ),
  NewsDatas(
    id: 'c6',
    titel:
        'اقامة حفل توديع لمدير عام الشؤون المالية السابق بالهيئة العامة للتأمينات والمعاشات',
    image: 'asset/a1.jpg',
    Date: '2021/11/16',
    titelNews:
        'اقيم في الهيئة العامة للتأمينات والمعاشات حفل توديع للاستاذ محمدالسنباني مديرعام الشؤن المالية السابق وذلك بحضور رئيس الهيئة الاستاذ ابراهيم احمد الحيفي رئيس الهيئة ،، ونائب رئيس الهيئة نبيل الغولي والوكيل الفني عارف العواضي وخلال الاحتفال قال رئيس الهيئة أن هذا الاحتفال يأتي تكريمآ للجهود وماحققه مديرعام الشؤون المالية السابق من نجاحات خلال فترة عمله بالهيئة من جانبه عبر الاخ محمدالسنباني مديرعام الشؤون المالية السابق عن شكره وتقديره لإقامة هذا الاحتفال الذي يعكس الروح الأخوية لدى قيادة الهيئة ورقيها في التعامل مع كل من عمل ضمن طاقم عمل الهيئة معبرا عن الاعتزاز والفخر للعمل خلال الفترة السابقة تحت قيادة الأستاذ ابراهيم الحيفي رئيس الهيئة الذي يعتبر رائدالعمل التأميني الأول في اليمن',
  ),
  NewsDatas(
    id: 'c7',
    titel:
        'فعالية اليوم الثقافي توكد ان التفريط والابتعاد عن هدى الله يخدم اعداء الأمة',
    image: 'asset/a1.jpg',
    Date: '2021/11/16',
    titelNews:
        'أقيمت صباح اليوم بالهيئة العامة للتأمينات والمعاشات فعالية اليوم الثقافي التي تقام صباح الأربعاء من كل اسبوع وخلال الفعاليه بحضور كافة الموظفين تم استعراض دروس من هدي القرآن الكريم للسيد القائد عبدالملك بدرالدين الحوثي قائد الثوره والسيد حسين بدرالدين الحوثي رضوان الله عليه وركزت الفعالية على نشر الوعي حول عدد من القضايا الهامة التي تعيشها الامة وفي مقدمتها خطورة التفريط الناجم عن الابتعاد عن هدى الله والانعكاسات السلبية المترتبة على ذلك ،، وأكدت الفعالية على ضرورة الاقتداء بالرسول الاعظم محمد صلى الله عليه و آله والذين كانو معه في مقدمة الصفوف مجاهدين بالنفس والمال ولم يتخلفو أو يقصرو وصنعوا أمجاد وانتصارات وتاريخ وحضارة للأمة الإسلامية في كل بقاع الأرض . واستعرضت الفعالية مشاهد وتصريحات تعكس حالة الانبطاح والشقاء والمآسي التي تعيشها بعض البلدان العربيه بسبب التفريط والابتعاد عن هدى الله وماوصل اليه حال بعض البلدان من خضوع وانبطاح وهرولة نحو التطبيع لاعداء الامة وفي مقدمتهم امريكا واسرائيل وهو ما جعل تلك البلدان وخاصة الخليجية تعيش حالة تيهان وظلالة اوصلتهم الى مرحلة من التفكك والضياع والانحطاط القيمي والأخلاقي لم يشهده العالم من قبل . وفي مداخلة قدمها الأستاذ ابراهيم احمدالحيفي رئيس الهيئة العامة للتأمينات والمعاشات دعا خلالها كافة الحضور الى ضرورة التركيز على محاضرة اليوم والاستفادة من مضامينها ،، لأن التفريط والتقصير يجعل الأمة ضعيفة مفككة وعاجزة وان التفريط يخدم أعداء الأمة الإسلامية وفي مقدمتهم أمريكا وإسرائيل',
  ),
  NewsDatas(
    id: 'c8',
    titel:
        'رئيس هيئة التأمينات يكرم المتدربين في اختتام دورة " لينكس " لمبرمجين ومهندسين الهيئة',
    image: 'asset/a1.jpg',
    Date: '2021/11/16',
    titelNews:
        'اختتمت عصر اليوم بالمركز التدريبي للهيئة العامة للتأمينات والمعاشات اعمال الدورة التدريبية حول " نظام تشغيل لينكس" والتي شارك فيها مهندسين ومبرمجين من الادارة العامة للحاسب الآلي بالهيئة وخلال الاختتام قام الاستاذ ابراهيم احمدالحيفي رئيس الهيئة بتكريم المدربين وتسليم شهادات مشاركة للمشاركين في الدورة واوضح الحيفي بأن الهيئة تنتظر بعد هذا الاختتام عطاء المتدربين وابداعاتهم على الواقع العملي وقال ان هذه الدورة النوعية تعتبر ضمن مشروع تحديث مركز المعلومات بالهيئة',
  ),
  NewsDatas(
    id: 'c9',
    titel:
        'النمطية والأدلة الإرشادية وفقا لقرار مجلس الوزراء رقم (161) لسنة 2021 م',
    image: 'asset/a1.jpg',
    Date: '2021/11/16',
    titelNews:
        '  قام الاستاذ ابراهيم الحيفي رئيس الهيئة العامة للتأمينات والمعاشات اليوم بتكريم المشاركين والمتدربين في ختام الدورة التدريبية التي اقيمت حول تطبيق الوثائق النمطية والأدلة الإرشادية وفقا لقرار مجلس الوزراء رقم (161) لسنة 2021 م والتي استمرت عشرة أيام بالمركز التدريبي للهيئة العامة للتأمينات والمعاشات   وفي حفل الاختتام القى الأستاذ ابراهيم احمد الحيفي رئيس الهيئة كلمة حث خلالها كوادر الهيئة المتدربين على تطبيق المحاضرات النظرية على الواقع العملي للنهوض بمستوى الأداء  وقال : ان تبني الهيئة لهذه الدورأت  يأتي من واقع الحرص على رفع قدرات ومهارات الموارد البشرية في مختلف المجالات على ضوء خطة التدريب للعام الحالي ووفقا للإحتياجات التدريبية بما يعزز توفير بيئة عمل محفزة للموظفين      لافتآ الى ان هذه الدورات تأتي مواكبة لسياسة الإرتقاء بمهارات واداء الموظفين في مختلف التخصصات بهدف تحقيق الفعالية الكاملة في مجالات العمل المختلفة .',
  ),
];
