import 'app/data/category.dart';
import 'app/data/trip.dart';

const Categories_date = const [
  Category(id: 'C1', title: 'الوضع المسكن', image: 'asset/k.png'),
  Category(id: 'C2', title: 'طلب تصحيح واستيفاء بيانات ', image: 'asset/e.png'),
];
const Trips_data = const [
  Trip(
    id: 'C1',
    activities: [
      '     وصف الخدمة :  ',
      'الرفع لوزارة الخدمة المدنية بتظلم المتقاعد حول الوضع المسكن فية لدراسة وضعة ومنحة ما يستحقه وفق القانون ',
    ],
    act: [
      'الشروط :',
      '- عدم تسكين المتقاعد وفقا لمؤهله أو سنوات خدمته ',
      '- عدم منح المتقاعد الاستراتيجيات الثالث كاملة',
    ],
    ac: [
      '    الوثائق والمستندات المطلوب  :',
      '* تقديم تظلم من المتقاعد',
      '* صورة من استمارة التسوية والربط',
      '* صورة من كشف آخر راتب + فتوى التسوية + قرار االحالة',
    ],
    activiti: [
      '  وصف الخدمة  :',
      'لرفع لوزارة الخدمة المدنية بتظلم المتقاعد حول الوضع المسكن فية لدراسة وضعة ومنحة ما يستحقه وفق القانون ',
    ],
  ),
  Trip(
    id: 'C2',
    activities: [
      'وصف الخدمة :',
      'طلب تصحيح بيانات المتقاعد ',
    ],
    act: [
      'الشروط : ',
      '- اخطاء الادخال ',
      ' - يجب ان يكون التعديل مطابقاً لاستمارة المسح ووثائق الملف التقاعدي',
    ],
    ac: [
      '    الوثائق والمستندات المطلوبة  :',
      '* الوثائق المؤيدة معمدة من الجهة المختصة',
    ],
    activiti: [
      'وصف الخدمة',
      'لرفع لوزارة الخدمة المدنية بتظلم المتقاعد حول الوضع المسكن فية لدراسة وضعة ومنحة ما يستحقه وفق القانون ',
    ],
  ),
];
