import 'app/data/insured.dart';
import 'app/data/tel.dart';

const Categorieste_add = const [
  Categoryte(id: 'C1', title: 'الابلاغ عن عدم استحقاق', image: 'asset/o.png'),
  Categoryte(id: 'C2', title: 'الابلاغ عن وفاة المتقاعد', image: 'asset/4.png'),
  Categoryte(id: 'C3', title: 'تجهيز وتكفين', image: 'asset/f.png'),
];
const Tripste_data = const [
  tel(
    id: 'C1',
    activities: [
      'وصف الخدمة:',
      'يتم الابلاغ عن عدم الاستحاق وفي حالات صحة البلاغ سيتم تنزيل الحالة والتواصل مع مقدم البلاغ لتحديد مواعد تسليمة مكافأة البلاغ'
    ],
    act: [
      'الشروط: ',
      '- يجب ان تكون كافة البيانات الواردة دقيقة ',
      '- عدم منح المتقاعد الاستراتيجيات الثالث كاملة',
    ],
    ac: [
      'الوثائق والمستندات المطلوبة',
      '*  تقديم تظلم من المتقاعد',
      '*  صورة من استمارة التسوية والربط',
      '*  صورة من كشف آخر راتب + فتوى التسوية + قرار االحالة',
    ],
    activiti: [
      '   وصف الخدمة :',
      'لرفع لوزارة الخدمة المدنية بتظلم المتقاعد حول الوضع المسكن فية لدراسة وضعة ومنحة ما يستحقه وفق القانون ',
    ],
  ),
  tel(
    id: 'C2',
    activities: [
      'وصف الخدمة',
      'إذا توفي المتقاعد صاحب المعاش تصرم الهيئة للمستحقين عنه منحة '
          'تعادل معاش شهرين لمواجهة تكاليف الجنازة تصرف فور تقديم أحد المستحقين أو وكيل االسرة المحدد'
          'من قبل المحكمة هادة الوفاة الصادرة من السجل المدني أو أي وثيقة معمدة من جهة رسمية',
    ],
    act: [
      'الشروط ',
      '- ان يكون المتوفي متقاعد ومعا شه مربوط لدى الهيئة ',
      '- ابالغ الفرع عن وفاة المتقاعد',
      '- الا تزيد المنحة عن معاش شهرين (قانوني)',
    ],
    ac: [
      'الوثائق والمستندات المطلوبة',
      ' * تقديم طلب صرف تكاليف الدفن من أحد المستحقين أو وكيل الالسرة المحدد من قبل المحكمة',
      '* إرفاق صورة كرت المعاش و هادة الوفاة الصادرة من السجل المدني أو أي وثيقة معمدة من جهة رسمية  ',
    ],
    activiti: [
      'وصف الخدمة',
      'لرفع لوزارة الخدمة المدنية بتظلم المتقاعد حول الوضع المسكن فية لدراسة وضعة ومنحة ما يستحقه وفق القانون ',
    ],
  ),
  tel(
    id: 'C3',
    activities: [
      'وصف الخدمة',
      'إذا توفي المتقاعد صاحب المعاش تصرم الهيئة للمستحقين عنه منحة '
          'تعادل معاش شهرين لمواجهة تكاليف الجنازة تصرف فور تقديم أحد المستحقين أو وكيل االسرة المحدد'
          'من قبل المحكمة هادة الوفاة الصادرة من السجل المدني أو أي وثيقة معمدة من جهة رسمية',
    ],
    act: [
      'الشروط ',
      '- ان يكون المتوفي متقاعد ومعا شه مربوط لدى الهيئة ',
      '- ابالغ الفرع عن وفاة المتقاعد',
      '- الا تزيد المنحة عن معاش شهرين (قانوني)',
    ],
    ac: [
      'الوثائق والمستندات المطلوبة',
      ' * تقديم طلب صرف تكاليف الدفن من أحد المستحقين أو وكيل الالسرة المحدد من قبل المحكمة',
      '* إرفاق صورة كرت المعاش و هادة الوفاة الصادرة من السجل المدني أو أي وثيقة معمدة من جهة رسمية  ',
    ],
    activiti: [
      'وصف الخدمة',
      'لرفع لوزارة الخدمة المدنية بتظلم المتقاعد حول الوضع المسكن فية لدراسة وضعة ومنحة ما يستحقه وفق القانون ',
    ],
  ),
];
