import 'app/data/category.dart';
import 'app/data/tri.dart';

const Category_date = const [
  Category(
      id: 'C1',
      title: ' تحويل الاحتياطيات من القطاع الخاص الى القطاع المدني العام',
      image: 'asset/a.png'),
  Category(
      id: 'C2', title: ' طلب تصحيح بيانات المؤمن عليه', image: 'asset/e.png'),
  Category(
      id: 'C3', title: ' بلاغ انهاء اشتراك مؤمن عليه', image: 'asset/g.png'),
  Category(id: 'C4', title: 'ابلاغ اصابة عمل ', image: 'asset/t.png'),
  Category(id: 'C5', title: ' مكافة نهاية الخدمة', image: 'asset/h.png'),
];
const Trip_data = const [
  Tri(
    id: 'C1',
    activities: [
      'وصف الخدمة :',
      ' إضافة مؤمن عليه الى نظام التأمين واخضاعه لقانون التأمينات والمعا شات والبدء بخصم الاقساط التأمينية',
    ],
    act: [
      'الشروط :',
      '- أن يكون سن الموظف من عمر15  سنه- تنص المادة رقم "73 "من القانون رقم "25 "لسفنة91م بشأن التأمينات والمعاشات على ما يلي :'
          ' (في حالة نقل او إعادة تعيين احد المستفدين من احكام قانون التقاعد العسكري او التفأمينفا التأمينات الاجتماعية الى عمل خاضع لالحكام هذا  القانون او العكس , تلتزم صناديق التأمين والمعشاتات التقاعد العسكري و التأمينات االجتماعية بتبادل حصيلة حصة المؤمن عليه و حصة جهة العمل في تأمين الشيخوخة و العجز و الوفاة من تاريخ الخضوع القانون  الذي عومل به حتى تاريخ ترك '
          'الخدمة وتسوى حقوقه عند انتهاء خدمته كماا لو كانت مدد اشتراكته جميعها في صندوق واحد وتحدد الالئحة قواعد تبادل حصيلة ا شتراكات تأمين الشيخوخة والعجز والوفاة'
    ],
    ac: [
      '  الوثائق والمستندات المطلوبة : ',
      '*من جهة العمل : ',
      ' * مذكرة من جهة العمل الحالية بطلب ضم خدمه المؤمن عليه سابق',
      '* قرار التثبيت أو فتوى التعيين ',
      '* صورة معمدة من كشف الراتب & استمارة المسح الوظيفي',
      '* المستندات والوثائق المطلوبة من  للتأمينات: -',
      '* استمارة صحيفة البيانات الاساسية موقعة ومختومة من المؤسسة العامة '
          'للتأمينات ومنضمنة مدد الخدمة السابقة واالمدد الخدمه السابقة والاشتراكات التأمينية المستحقة للهيئة عنها',
      '* كافة الوثائق التي تثبت الخدمة السابقة ',
      '* إرفاق شيك بالمبلغ المستحق للهيئة',
    ],
  ),
  Tri(
    id: 'C2',
    activities: [
      '    وصف الخدمة :',
      ' طلب تصحيح بيانات المؤمن عليه ( الشخصية - الوظيفية ...)',
    ],
    act: [
      'الشروط :',
      ' - يجب ان يكون التعديل مطابقاً لاستمارة المسح ووثائق الملف التقاعدي',
      '- أخطاءالادخال',
    ],
    ac: [
      '*  الوثائق والمستندات المطلوبة :   ',
      '*  الوثائق المؤيدة معمدة من الجهة المختصة ',
    ],
  ),
  Tri(
    id: 'C3',
    activities: [
      '   وصف الخدمة :',
      ' طلب الاحتالة للتقاعد حسب شروط التقاعد (بناء على طلبه... او الخروج من قانون التأمينات واستلام مكافئة نهايةالخدمة ',
    ],
    act: [
      '    الشروط  :',
      '- حسب القانون والمدة المحددة لكل سبب إحالة',
    ],
    ac: [
      'الوثائق والمستندات المطلوبة : ',
      '* طلب المؤمن عليه',
      '*',
      '*',
      '*',
    ],
  ),
  Tri(
    id: 'C4',
    activities: [
      '  وصف الخدمة :',
      ' طلب الإبلاغ عن إصابة العمل للمؤمن عليه وتعرضه لحادث او أي اطارئ يحدث له عند الذواب للعمل او اثناء العمل'
          'او العودة من العمل',
    ],
    act: [
      ' الشروط :',
      '- الإبلاغ عن الاصابة وفق المدة المحددة',
      '-وثائق واثبات الجهات المعنية',
      '- تقرير المستشفى',
    ],
    ac: [
      'الوثائق والمستندات المطلوبة :',
      '* الإبلاع الفرع في الوقت المحدد',
      'مذكرة جهة العمل',
      '*',
      '*',
    ],
  ),
  Tri(
    id: 'C5',
    activities: [
      '    وصف الخدمة :',
      ' طلب مكافئه عندما يريد المؤمن عليه وفق شروط ...',
    ],
    act: [
      'الشروط :',
      '- يستحق المؤمن عليه مكافأة نهاية خدمه لكل من:',
      '  1- انتهت خدمته عند بلوغ السن القانوني لإنهاء الخدمة ومدة خدمته اقل من الحد الادنى لاستحقاق المعاش.',
      '2- ان لا تقل مدة خدمته عن سنة كاملة وتصرف في الحالات التالية:',
      '·  الخروج نهائياً عن نطاق قوانين التأمينات السارية ',
      '· هجرة المؤمن عليه خارج الجمهورية'
          '·  استقالة المؤمن عليه لمرافقة الزوج المهاجر او لرعاية الأسرة او للزواج'
          '· التحاق المؤمن عليه بعمل لا يخضع فيه لأي من قوانين التأمينات السارية و لا تصرف المكافأة في  هذه الحالة إلا بعد مرور سنتين من تاريخ انتهاء خدمته',
      '·  إنهاء الخدمة بسبب إلغاء الوظيفة او الفصل التأديبي او بغير الطريق التأديبي ومدة الخدمة الفعلية غير مكسبه لاستحقاق المعاش',
      ' . الحكم النهائي على المؤمن عليه بالسجن لمدة خمس سنوات فأكثر او بلوغه سن الستين أيهما اقل',
      '· إصابة المؤمن عليه بعد انتهاء خدمته بعجز كلي مستديم ولم يكن قد صرفت له',
    ],
    ac: [
      '*  الوثائق والمستندات المطلوبة :   ',
      '*الوثائق الأساسية بالإضافة الى :  '
          '-مدكرة من وزارة الخدمة المدنية أو احد مكاتبها تفيد التأشير قي سجلاتها باستلام المستحقات وعدم وجود ازدواج '
          ' - في حالة هجرة المؤمن عليه خارج الجمهورية يشترط أن يتقدم بالوثائق التي تثبت الهجرة الوثائق المؤيدة معمدة من الجهة المختصة ',
    ],
  ),
];
