import 'app/data/trips.dart';
import 'app/data/worthy.dart';

const Categori_date = const [
  Categ(id: 'C1', title: 'الوضع المسكن', image: 'asset/k.png'),
  Categ(id: 'C2', title: 'الابلاغ عن حالة وفاة', image: 'asset/s.png'),
  Categ(id: 'C3', title: 'منحة زواج', image: 'asset/n.png'),
  Categ(id: 'C4', title: 'تجهيز وتكفين ', image: 'asset/f.png'),
  Categ(id: 'C5', title: 'طلب ضم مستحق ', image: 'asset/u.png'),
];
const trips = const [
  Tr(
    id: 'C1',
    activities: [
      ' وصف الخدمة :',
      'الرفع لوزارة الخدمة المدنية بتظلم المتقاعد حول الوضع المسكن فية لدراسة وضعة ومنحة ما يستحقه وفق القانون ',
    ],
    act: [
      'الشروط :',
      '- عدم تسكين المتقاعد وفقا المؤهله أو سنوات خدمته ',
      '- عدم منح المتقاعد الاستراتيجيات الثالث كاملة',
    ],
    ac: [
      'الوثائق والمستندات المطلوبة :',
      '* تقديم تظلم من المتقاعد',
      '* صورة من استمارة التسوية والربط',
      '* صورة من كشف آخر راتب + فتوى التسوية + قرار االحالة',
    ],
  ),
  Tr(
    id: 'C2',
    activities: [
      'وصف الخدمة',
      'إذا توفي المتقاعد صاحب المعاش تصرم الهيئة للمستحقين عنه منحة '
          'تعادل معاش شهرين لمواجهة تكاليف الجنازة تصرف فور تقديم أحد المستحقين أو وكيل االسرة المحدد'
          'من قبل المحكمة هادة الوفاة الصادرة من السجل المدني أو أي وثيقة معمدة من جهة رسمية',
    ],
    act: [
      'الشروط ',
      '- ان يكون المتوفي متقاعد ومعا شه مربوط لدى الهيئة ',
      '- ابالغ الفرع عن وفاة المتقاعد',
      '- الا تزيد المنحة عن معاش شهرين (قانوني)',
    ],
    ac: [
      'الوثائق والمستندات المطلوبة',
      ' * تقديم طلب صرف تكاليف الدفن من أحد المستحقين أو وكيل الالسرة المحدد من قبل المحكمة',
      '* إرفاق صورة كرت المعاش و هادة الوفاة الصادرة من السجل المدني أو أي وثيقة معمدة من جهة رسمية  ',
    ],
  ),
  Tr(
    id: 'C3',
    activities: [
      '  وصف الخدمة :',
      ' يكون  طلب منحة زواج وفقاً لقانون التأمينات والمعاشات المنظم لعملية صرف منحة الزواج ',
    ],
    act: [
      'الشروط :',
      '- زواج احد الاناث المستحقات',
    ],
    ac: [
      'الوثائق والمستندات المطلوبة :',
      ' *وثيقة اثبات الشخصية بالرقم الوطني ',
      ' *عقد الزواج معمد من المحكمة  ',
    ],
  ),
  Tr(
    id: 'C4',
    activities: [
      'وصف الخدمة',
      'إذا توفي المتقاعد صاحب المعاش تصرم الهيئة للمستحقين عنه منحة '
          'تعادل معاش شهرين لمواجهة تكاليف الجنازة تصرف فور تقديم أحد المستحقين أو وكيل االسرة المحدد'
          'من قبل المحكمة هادة الوفاة الصادرة من السجل المدني أو أي وثيقة معمدة من جهة رسمية',
    ],
    act: [
      'الشروط ',
      '- ان يكون المتوفي متقاعد ومعا شه مربوط لدى الهيئة ',
      '- ابالغ الفرع عن وفاة المتقاعد',
      '- الا تزيد المنحة عن معاش شهرين (قانوني)',
    ],
    ac: [
      'الوثائق والمستندات المطلوبة',
      ' * تقديم طلب صرف تكاليف الدفن من أحد المستحقين أو وكيل الالسرة المحدد من قبل المحكمة',
      '* إرفاق صورة كرت المعاش و هادة الوفاة الصادرة من السجل المدني أو أي وثيقة معمدة من جهة رسمية  ',
    ],
  ),
  Tr(id: 'C5', activities: [
    'وصف الخدمة:',
    'أضافة مستحق غير مسجل في المعاش التقاعدي ',
  ], act: [
    'الشروط: ',
    ' - ثبوت الاستحقاق وفق قانون التأمينات والمعاشات',
  ], ac: [
    'الوثائق والمستندات المطلوبة :',
    ' * البطاقة الشخصية بالرقم الوطني'
        '* طلب الضم موضحاً به  سبب عدم الضم سابقاً   ',
    '* البطاقة العائلية ان وجدت '
        '* إقرار حصر الاعالة ان لم يسبق احضاره ',
    '* حكم الانحصار ان لم يسبق احضاره',
    'الوثائق الاضافية في حالة ضم أخ - أخت:',
    ' *حكم اعالة اثناء حياة المتقاعد صادر من المحكمة',
    'الوثائق الاضافية في حالة ضم أبناءالابن: '
        ' * شهادة وفاة الابن+ حكم انحصار وراثة للابن او البطاقة العائلية ',
  ]),
];
