import 'package:flutter/material.dart';

class CardON extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Center(child: Text('رئيس مجلس الإدارة')),
      ),
      body: SingleChildScrollView(
        child: Card(
          child: Column(
            children: [
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Container(
                  width: double.infinity,
                  height: 300,
                  decoration: BoxDecoration(
                      borderRadius: BorderRadius.circular(20),
                      image: DecorationImage(
                          image: AssetImage(
                            'asset/c1.jpg',
                          ),
                          fit: BoxFit.fill)),
                ),
              ),
              Card(
                child: Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                      'أ/ سليم محمد المغلس.\n  '
                      'وزير الخدمة المدنية والتأمينات–رئيس مجلس الإدارة '
                      'امام التحولات الكبرى التي يشهدها شعبنا في شتى المجالات وفي مقدمتها ما يحققه من إنجازات على الصعيدين العسكري والسياسي تبرز تحديات رئيسية في الجبهة الإدارية باعتبار ان الإدارة العامة هي يد الدولة لقيامها بمهامها المختلفة وتلبيتها لشتى الاحتياجات وقد اثبتت التجارب الانسانية انه لا يمكن الحديث عن رؤية لبناء الدولة او خطة تطويرية إلا بتوفر جهاز اداري كفوء قادر على النهوض بمسئولياته والوفاء بالأمانة الملقاة على عاتقة . ولذلك فأن الخطوة الأولى في هذا المسار الاستراتيجي هي الشروع في اصلاح الإدارة الحكومية وتطوير أداء أجهزة الدولة انطلاقا من المرجعيات التي حددها السيد القائد يحفظه الله من خلال تقديم النموذج الشاهد على عظمة المشروع وبناء الدولة الكريمة المنشودة دولة الحق والعدل التي تمتلك قرارها الوطني وتحقق سيادتها على كامل اراضيها وتتحرر من الوصاية والارتهان للخارج . ويتزامن هذا التحول الكبير مع تجسيد قيم المسؤولية في ادارة الشان العام والتعامل مع الوظيفة العامة كمسؤلية وامانة في خدمة الناس والبداية من احداث تغييرات جوهرية في آلية الادارة والأداء الحكومي اسلوباً وممارسة ووتغيير ثقافة وسلوكيات العاملين لاستيعاب هذا التحول . ورغم التحديات والصعوبات الماثلة أمامنا وفي مقدمتها العدوان الغاشم وانعكاساته على المرافق الحكومية المختلفة ،، الا ان ذلك لن يقف حائلا بعون الله في انجاز هذا المشروع ومثلما تمضي الجبهة العسكرية بارادة لا تلين يجب أن تنطلق وبالتوازي الجبهة الادارية في اطار مشروع يد تحمي ويد تبني الذي اطلقه خالد الذكر الشهيد الرئيس صالح الصماد رضوان الله عليه . وينطلق هذا المشروع بالتركيز على محورين الأول إعادة تأهيل وبناء الكادر البشري الذي يتبنى عملية الإصلاح والثاني تهيئة البيئة والمناخ الملائم للقيام بعملية الإصلاحات مستلهمين الارادة والعزيمة من السيد القائد عبدالملك بدرالدين الحوثي يحفظه الله ،،وتوجيهات القيادة السياسية برئاسة فخامة الرئيس مهدي المشاط رئيس المجلس السياسي الاعلى ،.  ومن هذا المنطلق أصبح اصلاح الإدارة العامة أولوية عاجلة تقتضيه مستجدات السياق الراهن وتفرضه تحديات المرحلة المقبلة بما يمهد لإرساء النموذج في ادارة الدولة ونتطلع جميعاً سواء في قيادة وزارة الخدمة المدنية او في مجلس ادارة الهيئة العامة للتأمينات والمعاشات بمختلف تكويناتها ومستوياتها للعمل وفق خطط وبرامج مدروسة في سبيل الارتقاء بالأداء الوظيفي وصولآ الى اعادة الاعتبار للوظيفة العامة وتحقيق التنمية الإدارية ، كخيار استراتيجي لضمان وجود الحامل لمشروع بناء الدولة وإيجاد مؤسسات تخدم المواطن لا مخدومة منه، فالعمل في اي مرفق حكومي مسؤوليه كبيرة أمام الله ،، وتعتبر رديف ومكمل للاعمال الجهادية العظيمة في الجبهات ،، والبداية من هذه المؤسسة العملاقة ( هيئة التأمينات والمعاشات ) التي استطاعت الصمود رغم الاستهداف المنهج لها من العدو وحافظت على رسالتها ودورها المحوري كصرح اقتصادي وخدمي استراتيجي يمثل أحد اهم الروافد للاقتصاد الوطني والتنمية الشاملة في بلدنا ،، ولا يفوتنا هنا الاشارة إلى مالمسناه من عمل دؤوب وانجازات ملموسة في الارتقاء بالعمل التأميني بشكل مظطرد في مختلف الجوانب سواء في حوسبة العمل الإداري وادخال التقنية في شتى مجالات العمل وانهاء الاختلالات في ملفات المتقاعدين وقواعد بيانات المؤمن عليهم بالاعتماد على الرقم الوطني . مع المضي في مسار تعزيز موارد الهيئة واستثمارها بما يعود بالفائدة على منتسبيها والمستفيدين من خدماتها والوطن بشكل عام من خلال الاستثمار النوعي الهادف والمشاركة في التنمية الاقتصادية باعتبار أن الهيئة العامة للتأمينات والمعاشات تمثل صندوقاً سياديا للبلد يجب علينا كلاً في حدود مسئولياته وواجباته العمل على دعمها في هذا المجال لرفد الاقتصاد الوطني وتحريك عجلة الإنتاج والتنمية وصولا إلى تحقيق الاكتفاء الذاتي وفي هذا السياق واستمرارا لتحريك عجلة البناء في هذا الصرح العملاق ،،  فإننا نؤكد سعينا الدائم لتذليل اي صعوبات قد تظهر والتغلب على كافة المشاكل التى تقف او ستقف امام تأديتها لواجباتها سواء في اعمالها الخدمية للمتقاعدين والمؤمن عليهم او خلال اعمالها الاقتصادية والاستثمارية   وسنكون بأذن الله عونآ  للهيئة  من خلال الاهتمام بشريحة المتقاعدين والانتقال بهم الى مستوى معيشي لائق بهم ويليق بمكانتهم الاجتماعية فقد مثل انطلاق الرؤية الوطنية لبناء الدولة اليمنية الحديثة فرصة سانحة لنا ولكافة المشتغلين والمهتمين والمعنيين والمختصين بالعمل التأميني للقطاع العام التي وجدنا فيها تحقيق الكثير من الاهداف والرؤى والطموحات للارتقاء بمستوى اداء وانشطة ومهام وخدمات التأمينات المقدمة بوسائل وامكانات حديثة ومتطورة تتناسب ومختلف المراحل العمرية للأخوة المتقاعدين والفئات والشرائح التأمينية الواجب على الهيئة العامة للتأمينات والمعاشات رعايتهم وتأمين احتياجاتهم المعيشية بشكل وبمستوى افضل .   في الاخير اود ان اسجل هنا كلمة شكر وتقدير لكافة قيادةوموظفي الهيئة العامة للتأمينات والمعاشات على مستوى المركز والفروع بالمحافظات يتقدمهم الاخ/ ابراهيم الحيفي رئيس الهيئة على ما يبذلونه من جهود طيبة وممتازة في ادائهم للواجبات المناطة بهم وعلى ما حققوه من خطوات اثمرت في الانتصار لقضايا وحقوق الاخوة المتقاعدين بعموم محافظات الجمهورية وفي الختام انتهز هذه الفرصة :  لأتقدم باسمي ونيابة عن مجلس الهيئة العامة للتأمينات والمعاشات ببالغ الشكر والتقدير للجهود المتميزة التي يبذلها كافة العاملين في المجال التاميني خصوصاً في ضل العدوان والحصار الغاشم على بلدنا، ولا ننسى ابناء الجيش واللجان الشعبية الذين يضحون من اجل الوطن والامة ويلقنون طغاة العصر وشذاذ الافاق هزائم متتالية في مختلف ميادين الشرف والبطولة . واسأل الله لنا ولكم ولشعبنا وامتنا النصر المؤزر على العدوان والحرية والأمن والاستقرار والتطور والنماء للوطن. ',
                      style: TextStyle(
                          fontSize: 25,
                          color: Colors.black,
                          fontFamily: 'Amiri')),
                ),
              )
            ],
          ),
        ),
      ),
    );
  }
}
