import 'package:flutter/material.dart';

class CartTow extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Center(child: Text('كلمة رئيس الهيئة')),
      ),
      body: SingleChildScrollView(
        child: Card(
          child: Column(
            children: [
              Padding(
                padding: const EdgeInsets.all(10.0),
                child: Container(
                  width: double.infinity,
                  height: 300,
                  decoration: BoxDecoration(
                      borderRadius: BorderRadius.circular(20),
                      image: DecorationImage(
                          image: AssetImage(
                            'asset/c2.png',
                          ),
                          fit: BoxFit.fill)),
                ),
              ),
              Card(
                child: Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                      'بقلم الاستاذ / ابراهيم احمد الحيفي.\n  '
                      'رئيس الهيئة\n '
                      '             معاً.. للارتقاء بالعمل التاميني                 '
                      'تعتبر الهيئة العامة للتأمينات والمعاشات واحده من المرافق الهامة الرافدة للاقتصاد الوطني والتنمية الشاملة بشكل عام. -ولأهمية هذا المرفق نعمل جاهدين مع كوادرنا في الهيئة للنهوض بمستوى الأداء والارتقاء بالعمل التاميني ,, وبفضل الله وبتعاون الجميع في الهيئة وكافة موظفي الهيئة قطعنا شوطاً كبيراً في هذا المضمار رغم الظروف والتحديات الصعبه التي يواجهها الوطن بسبب العدوان الغاشم والحصار الاقتصادي الجائر على البلاد. -وللوقوف أمام أبرز المحطات التي تحققت فاننا عملنا خلال العام المنصرم على الاهتمام بالكادر البشري للهيئة في سبيل تحسين القدرات والمهارات من اجل تحسين الأداء الكلي للهيئة من خلال برامج تدريبيه هادفه ومدروسة وفقاً لاحتياجات العمل التاميني . -كما عملنا وبتعاون المخلصين في الهيئة على الإرتقاء بالعمل وإدخال النظام الآلي وتوسيع قاعدة الربط الشبكي بين الهيئة وفروعها ’’’ ومؤخراً بين الهيئة ووزارة الخدمة المدنية والتأمينات. -وحالياً يجرى العمل بوتيرة عالية في مشروع الأرشفة الإلكترونية لبيانات المتقاعدين وهى خطوه مهمه من اجل حفظ وارشفة بيانات المتقاعدين وأسرهم والتي سيتم إستكمالها بإذن الله خلال هذا العام. - إن ماسبق ذكره يعتبر جزء يسيراً مما قمنا به لكننا في الهيئة نعمل بوتيرة عالية وكخليه نحل واحده مع فريق عمل رائع من مدراء ورؤساء الأقسام والمختصين داخل الهيئة الذين بفضل جهودهم جميعاً استطاعت الهيئة تحقيق تطور ملموس في مختلف المجالات ومع ذلك ورغم ماتحقق من إنجازات إنعكست على المتقاعدين وعلى الهيئة الاإننا لم نصل الى مستوى الطموح وتحقيق الأهداف التي نريد الوصول اليها، لكننا وكما قلنا نمضي بخطوات مدروسة وعلميه. وكل انجاز سنحققه سنقوم بإبرازه عبر الموقع الالكتروني للهيئة الذي يعتبر نافذتنا على العالم الخارجي والداخلي ,, وسيكون القادم افضل بإذن الله . ',
                      style: TextStyle(
                          fontSize: 25,
                          color: Colors.black,
                          fontFamily: 'Amiri')),
                ),
              )
            ],
          ),
        ),
      ),
    );
  }
}
