import 'package:flutter/material.dart';

class CardFor extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Center(child: Text('الأهداف الرئيسية للهيئة')),
      ),
      body: Card(
        child: Padding(
          padding: const EdgeInsets.all(10.0),
          child: Text(
              '1-'
              'تحقيـق مستـوى معـيشي مناسـب للمتقاعدين بعـد انتهاء الخدمة وإعالة أسرهم في حالة الوفاة\n'
              '2-'
              '    المساهمة في التخفيف من الفقر وذلك من خلال تدفق المعاشات للمتقاعدين الذين يمثلون شريحة اجتماعية واسعة في أي مجتمع\n '
              '3-'
              'العمل على تنظيم علاقة العمل واستقرارها بين المؤمن عليهم وجهة العمل .\n'
              '4-'
              " المحافظة على حقوق القوى العــــاملة في المجتمع وتحريرها من الخوف من الشيخوخة والعجز والوفاة وإصابات العمل\n "
              '5-'
              'خلق فرص العمل من خلال إحالة من بلغوا أحد الأجلين إلى المعاش وإحلال موظفين جدد بلغوا أحد الأجلين إلى المعاش وإحلال موظفين جددالمشاريع الاستثمارية التي تساهم بها الهيئة\n'
              '6-'
              'زيادة حجم الإنتاج من خلال زيادة حجم الاستثمارات في المشاريع الإنتاجية المختلفة\n',
              style: TextStyle(
                  fontSize: 25, color: Colors.black, fontFamily: 'Amiri')),
        ),
      ),
    );
  }
}
